Tekla.Structures.Model.RebarPropertyModifier
The RebarPropertyModifier class represents a modifier that can modify the characteristics of Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
The following example shows how to create and add a RebarPropertyModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarPropertyModifier
var strip = new RebarPropertyModifier();
strip.Father = rebarSet;
strip.GroupingType = RebarPropertyModifier.GroupingTypeEnum.AUTOMATIC;
strip.RebarProperties.Name = "REBAR";
strip.RebarProperties.Class = 3;
strip.RebarProperties.Grade = "H";
strip.RebarProperties.Size = "12";
strip.RebarProperties.BendingRadius = 24;
strip.RebarProperties.NumberingSeries.StartNumber = 1;
// Override the rebar set spacings in the region of the property modifier
strip.SpacingOverride = ReinforcementSpacing.Create(
ReinforcementSpacing.SpacingType.EXACT_FLEXIBLE_LAST,
new ReinforcementSpacing.Offset { Automatic = true, Type = ReinforcementSpacing.OffsetEnum.EXACT, Distance = 0.0 },
new ReinforcementSpacing.Offset { Automatic = true, Type = ReinforcementSpacing.OffsetEnum.EXACT, Distance = 0.0 },
100.0);
strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 200, 0), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 1000, 0), null));
strip.Insert();
}
}